# ვთხოვთ მომხმარებელს ასაკის შეყვანას
age = int(input("შემოიტანეთ თქვენი ასაკი: "))  # input() ფუნქცია იღებს ასაკის მონაცემებს როგორც სტრინგს, ამიტომ ვიყენებთ int() კონვერტირებას რიცხვში

# ვამოწმებთ, არის თუ არა ასაკი 18-დან 25 წლამდე
if 18 <= age <= 25:
    # ასაკი შედის მითითებულ დიაპაზონში
    print("თქვენი ასაკი 18-დან 25 წლამდეა.")
else:
    # ასაკი არ შედის მითითებულ დიაპაზონში
    print("თქვენი ასაკი არ არის 18-დან 25 წლამდე.")






# ვთხოვთ მომხმარებელს ბიუჯეტის შეყვანას
budget = float(input("შემოიტანეთ თქვენი ბიუჯეტი (ლარებში): "))  # input() ფუნქცია იღებს ბიუჯეტის მონაცემებს როგორც სტრინგს, ამიტომ ვიყენებთ float() კონვერტირებას ათობით რიცხვში

# ვამოწმებთ, არის თუ არა ბიუჯეტი 50 ლარზე მეტი ან 100 ლარზე მეტი
if budget > 100:
    # ბიუჯეტი აღემატება 100 ლარს
    print("თქვენი ბიუჯეტი 100 ლარზე მეტია.")
elif budget > 50:
    # ბიუჯეტი 50 ლარზე მეტი, მაგრამ არ აღემატება 100 ლარს
    print("თქვენი ბიუჯეტი 50 ლარზე მეტია, მაგრამ 100 ლარზე ნაკლებია.")
else:
    # ბიუჯეტი არ აღემატება 50 ლარს
    print("თქვენი ბიუჯეტი 50 ლარს ნაკლებია.")
