# ვთხოვთ მომხმარებელს შემოიტანოს პირველი რიცხვი და ვინახავთ ცვლადში num1
# num1 = float(input("შემოიტანეთ პირველი რიცხვი: "))  # input() ფუნქცია გამოიყენება მონაცემების შემოტანისთვის. float() ფუნქცია კონვერტირებს შემოტანილ სტრინგს რიცხვში

# ვთხოვთ მომხმარებელს შემოიტანოს მეორე რიცხვი და ვინახავთ ცვლადში num2
# num2 = float(input("შემოიტანეთ მეორე რიცხვი: "))

# ვთხოვთ მომხმარებელს შემოიტანოს მესამე რიცხვი და ვინახავთ ცვლადში num3
# num3 = float(input("შემოიტანეთ მესამე რიცხვი: "))

# ვთხოვთ მომხმარებელს შემოიტანოს მეოთხე რიცხვი და ვინახავთ ცვლადში num4
# num4 = float(input("შემოიტანეთ მეოთხე რიცხვი: "))

# ვაკეთებთ და ვბეჭდავთ არითმეტიკულ ოპერაციებს
# print(f"{num1} + {num2} = {num1 + num2}")  # ჯამი
# print(f"{num1} - {num2} = {num1 - num2}")  # გამოკლება
# print(f"{num1} * {num2} = {num1 * num2}")  # ნამრავლი
# print(f"{num1} / {num2} = {num1 / num2}")  # გაყოფა

# print(f"{num3} + {num4} = {num3 + num4}")
# print(f"{num3} - {num4} = {num3 - num4}")
# print(f"{num3} * {num4} = {num3 * num4}")
# print(f"{num3} / {num4} = {num3 / num4}")

# შედარების ოპერატორები პირველ ორ რიცხვზე
# print(f"{num1} > {num2} არის {num1 > num2}")  # დიდი
# print(f"{num1} < {num2} არის {num1 < num2}")  # მცირე
# print(f"{num1} == {num2} არის {num1 == num2}")  # ტოლი
# print(f"{num1} != {num2} არის {num1 != num2}")  # არატოლი
